onvif/PtzControl.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header>%s</s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><ContinuousMove xmlns="http://www.onvif.org/ver20/ptz/wsdl"><ProfileToken>%s</ProfileToken><Velocity><PanTilt x="%d" y="%d" xmlns="http://www.onvif.org/ver10/schema"/><Zoom x="%d" xmlns="http://www.onvif.org/ver10/schema"/></Velocity></ContinuousMove></s:Body></s:Envelope>